////----------------------------------------------------------------------------------

//ФУНКЦИИ
//Функциональные выражения
//Аргументы и параметры
// Возврат значения-

// ЕСЛИ return ПОСТАВИТЬ В САМОМ НАЧАЛЕ ФУНКЦИИ СКРИПТ НЕ БУДЕТ ВЫПОЛНЯТСЯ ДАЛЬШЕ

// const add = function (x, y) {
//   console.log(x);

//   console.log(y);

//   console.log("Выполняется функция add");

//   return x + y;
// };

// const r1 = add(5, 3);

// console.log("r1: ", r1);

// const r2 = add(10, 15);

// console.log("r2: ", r2);

// const r3 = add(30, 50);

// console.log("r3: ", r3);

/////////////////////////////////////////////////////////////////////////////////////////

///////////////////////////////////////////////////////////////////////////////////////
//ФУНКЦИИ СТЭК ВЫЗОВОВ
//ОЧЕНЬ НУЖНО ЗНАТЬ МОДУЛЬ 2 ЗАНЯТИЕ 4, 36 МИНУТА РЕПЕТЫ
//РАБОТАЕТ ПО ПРИНЦИПУ МАТРЕШКИ СЛАЖИВАТЬСЯ И РАЗЛАЖИВАЮТСЯ
////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////

///-------------------------------------------------------------------------------------
//                              задача

// напиши функцию calculateTotalPrice которая принимает массив цен (чисел) и возвращает их сумму

// const calculateTotalPrice = function (items) {
//   console.log("items");

//   let total = 0;

//   for (const item of items) {
//     total += item;
//   }
//   return total;
// };

// console.log(calculateTotalPrice([1, 2, 3])); // 6

// console.log(calculateTotalPrice([5, 10, 15, 20])); // 50

// console.log(calculateTotalPrice([100, 200, 300])); // 600
///////////////////////////////////////////////////////////////////////////////////////

/////----------------------------------------------------------------------------------

//                      задача

//Напиши функцию changeCase(string) которая заменяет регистр
// каждого символа в строке на противоположный.
//Например, если строка «JavaScript», то на выходе должна быть строка «jAVASCRIPT».

// console.log('invertedString: ', invertedString);

// const changeCase = function (string) {
//   const letters = string.split("");

//   let invertedString = "";

//   for (const letter of letters) {
//     const isInLowerCase = letter === letter.toLowerCase();

//     invertedString += isInLowerCase
//       ? letter.toUpperCase()
//       : letter.toLowerCase();
//   }

//   return invertedString;
// };

// console.log(changeCase("qweRTY")); // QWErty

// console.log(changeCase("mAnGo")); // MaNg0

// console.log(changeCase("AjAx")); // aJax

////////////////////////////////////////////////////////////////////////////////////////////

/////============================================================================
// псевдо массив arguments и array. form
///

// const fn = function (...args) {
//   console.log(args);
// };

// fn(1, 2, 3);
// fn(1, 2, 3, 55, 77);
// fn(1, 2, 3, 66, 55, 66, 89);

///////////////////////////////////////////////////////////////////////////////////////////////

///----------------------------------------------------------------------------------
//                              задача

// напиши функцию add для сложения произвольного количества аргументов (чисел)
// операция ....(rest)

// const add = function (...args) {
//   console.log(args);
//   let total = 0;

//   for (const arg of args) {
//     total += arg;
//   }
//   return total;
// };

// console.log(add(1, 2, 3));
// console.log(add(5, 10, 15, 20, 10));
// console.log(add(5, 10, 15, 20, 10, 20));

////////////////////////////////////////////////////////////////////////////////////////////////
